In [1]:
import pandas as pd

df = pd.read_csv (r'C:/Users/karthik/ML/titanic.csv')
df.head(5)

,last,first,gender,age,class,fare,embarked,survived
0,Braund,Mr. Owen Harris,M,22.0,3,7.2500,Southampton,no
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38.0,1,71.2833,Cherbourg,yes
2,Heikkinen,Miss Laina,F,26.0,3,7.9250,Southampton,yes
3,Futrelle,Mrs. Jacques Heath (Lily May Peel),F,35.0,1,53.1000,Southampton,yes
4,Allen,Mr. William Henry,M,35.0,3,8.0500,Southampton,no

In [2]:
# To create a new data frame

# Load library
import pandas as pd
# Create DataFrame
dataframe = pd.DataFrame()
# Add columns
dataframe['Name'] = ['Jacky Jackson', 'Steven Stevenson']
dataframe['Age'] = [38, 25]
dataframe['Driver'] = [True, False]
# Show DataFrame
dataframe

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False

In [3]:
# Appending new rows to the bottom:
# Create row
new_person = pd.Series(['Molly Mooney', 40, True], index=['Name','Age','Driver'])
# Append row
dataframe.append(new_person, ignore_index=True)

               Name  Age  Driver
0     Jacky Jackson   38    True
1  Steven Stevenson   25   False
2      Molly Mooney   40    True

In [4]:
import pandas as pd

df = pd.read_csv (r'C:/Users/karthik/ML/titanic.csv')
# Show dimensions
df.shape

(891, 8)

In [5]:
# Show statistics
df.describe()

              age       class        fare
count  714.000000  891.000000  891.000000
mean    29.699118    2.308642   32.204208
std     14.526497    0.836071   49.693429
min      0.420000    1.000000    0.000000
25%     20.125000    2.000000    7.910400
50%     28.000000    3.000000   14.454200
75%     38.000000    3.000000   31.000000
max     80.000000    3.000000  512.329200

In [6]:
import pandas as pd

df = pd.read_csv (r'C:/Users/karthik/ML/titanic.csv')
# Select first row
df.iloc[0]

last                 Braund
first       Mr. Owen Harris
gender                    M
age                      22
class                     3
fare                   7.25
embarked        Southampton
survived                 no
Name: 0, dtype: object

In [7]:
import pandas as pd

df = pd.read_csv (r'C:/Users/karthik/ML/titanic.csv')
# Select three rows
df.iloc[1:4]

,last,first,gender,age,class,fare,embarked,survived
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38.0,1,71.2833,Cherbourg,yes
2,Heikkinen,Miss Laina,F,26.0,3,7.9250,Southampton,yes
3,Futrelle,Mrs. Jacques Heath (Lily May Peel),F,35.0,1,53.1000,Southampton,yes

In [8]:
import pandas as pd

df = pd.read_csv (r'C:/Users/karthik/ML/titanic.csv')
# Select three rows
df.iloc[:4]

,last,first,gender,age,class,fare,embarked,survived
0,Braund,Mr. Owen Harris,M,22.0,3,7.2500,Southampton,no
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38.0,1,71.2833,Cherbourg,yes
2,Heikkinen,Miss Laina,F,26.0,3,7.9250,Southampton,yes
3,Futrelle,Mrs. Jacques Heath (Lily May Peel),F,35.0,1,53.1000,Southampton,yes

In [9]:

import pandas as pd

dataframe = pd.read_csv (r'C:/Users/karthik/ML/titanic.csv')
# Set index
dataframe = dataframe.set_index(dataframe['first'])
# Show row
dataframe.loc['Miss Laina']

last          Heikkinen
first        Miss Laina
gender                F
age                  26
class                 3
fare              7.925
embarked    Southampton
survived            yes
Name: Miss Laina, dtype: object

In [10]:
import pandas as pd

dataframe = pd.read_csv (r'C:/Users/karthik/ML/titanic.csv')
# Show top two rows where column 'sex' is 'female'
dataframe[dataframe['gender'] == 'F'].head(2)

,last,first,gender,age,class,fare,embarked,survived
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38.0,1,71.2833,Cherbourg,yes
2,Heikkinen,Miss Laina,F,26.0,3,7.9250,Southampton,yes

In [11]:
# Filter rows
dataframe[(dataframe['gender'] == 'F') & (dataframe['class'] == 3)].head(3)

,last,first,gender,age,class,fare,embarked,survived
2,Heikkinen,Miss Laina,F,26.0,3,7.9250,Southampton,yes
8,Johnson,Mrs. Oscar W (Elisabeth Vilhelmina Berg),F,27.0,3,11.1333,Southampton,yes
10,Sandstrom,Miss Marguerite Rut,F,4.0,3,16.7000,Southampton,yes

In [12]:
# Replace values, show two rows
dataframe['gender'].replace("F", "Female").head(2)

0         M
1    Female
Name: gender, dtype: object

In [13]:
# Replace "female" and "male with "Woman" and "Man"
dataframe['gender'].replace(["F", "M"], ["Female", "Male"]).head(5)

0      Male
1    Female
2    Female
3    Female
4      Male
Name: gender, dtype: object

In [14]:
# Replace values, show two rows
dataframe.replace(1, "One").head(2)

,last,first,gender,age,class,fare,embarked,survived
0,Braund,Mr. Owen Harris,M,22,3,7.2500,Southampton,no
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38,One,71.2833,Cherbourg,yes

In [15]:
# Replace values, show two rows
dataframe.replace(r"1st", "First", regex=True).head(2)

,last,first,gender,age,class,fare,embarked,survived
0,Braund,Mr. Owen Harris,M,22.0,3,7.2500,Southampton,no
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38.0,1,71.2833,Cherbourg,yes

In [16]:
# Rename column, show two rows
dataframe.rename(columns={'class': 'Passenger Class'}).head(2)

,last,first,gender,age,Passenger Class,fare,embarked,survived
0,Braund,Mr. Owen Harris,M,22.0,3,7.2500,Southampton,no
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38.0,1,71.2833,Cherbourg,yes

In [17]:
# Rename columns, show two rows
dataframe.rename(columns={'class': 'Passenger Class', 'first': 'First Name'}).head(2)

,last,First Name,gender,age,Passenger Class,fare,embarked,survived
0,Braund,Mr. Owen Harris,M,22.0,3,7.2500,Southampton,no
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38.0,1,71.2833,Cherbourg,yes

In [18]:
# Load library
import collections
# Create dictionary
column_names = collections.defaultdict(str)
# Create keys
for name in dataframe.columns:
 column_names[name]
# Show dictionary
column_names

defaultdict(str,
            {'last': '',
             'first': '',
             'gender': '',
             'age': '',
             'class': '',
             'fare': '',
             'embarked': '',
             'survived': ''})

In [19]:
# Calculate statistics
print('Maximum:', dataframe['age'].max())
print('Minimum:', dataframe['age'].min())
print('Mean:', dataframe['age'].mean())
print('Sum:', dataframe['age'].sum())
print('Count:', dataframe['age'].count())

Maximum: 80.0
Minimum: 0.42
Mean: 29.69911764705882
Sum: 21205.17
Count: 714

In [20]:
# Show counts
dataframe.count()

last        891
first       891
gender      891
age         714
class       891
fare        891
embarked    891
survived    891
dtype: int64

In [21]:
# Select unique values
dataframe['gender'].unique()

array(['M', 'F'], dtype=object)

In [22]:
# Show counts
dataframe['gender'].value_counts()

M    577
F    314
Name: gender, dtype: int64

In [23]:
# Show counts
dataframe['class'].value_counts()

3    491
1    216
2    184
Name: class, dtype: int64

In [24]:
# Show number of unique values
dataframe['class'].nunique()

3

In [25]:
## Select missing values, show two rows
dataframe[dataframe['age'].isnull()].head(2)

,last,first,gender,age,class,fare,embarked,survived
5,Moran,Mr. James,M,NaN,3,8.4583,Queenstown,no
17,Williams,Mr. Charles Eugene,M,NaN,2,13.0000,Southampton,yes

In [26]:
# Delete column
dataframe.drop('age', axis=1).head(2)

,last,first,gender,class,fare,embarked,survived
0,Braund,Mr. Owen Harris,M,3,7.2500,Southampton,no
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,1,71.2833,Cherbourg,yes

In [27]:
# Drop columns
dataframe.drop(['age', 'gender'], axis=1).head(2)

,last,first,class,fare,embarked,survived
0,Braund,Mr. Owen Harris,3,7.2500,Southampton,no
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),1,71.2833,Cherbourg,yes

In [28]:
# Drop column
dataframe.drop(dataframe.columns[1], axis=1).head(2)

      last gender   age  class     fare     embarked survived
0   Braund      M  22.0      3   7.2500  Southampton       no
1  Cumings      F  38.0      1  71.2833    Cherbourg      yes

In [29]:
# Delete rows, show first two rows of output
dataframe[dataframe['gender'] != 'M'].head(2)

,last,first,gender,age,class,fare,embarked,survived
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38.0,1,71.2833,Cherbourg,yes
2,Heikkinen,Miss Laina,F,26.0,3,7.9250,Southampton,yes

In [30]:
# Delete row, show first two rows of output
dataframe[dataframe['first'] != 'Mr. Charles Eugene'].head(2)

,last,first,gender,age,class,fare,embarked,survived
0,Braund,Mr. Owen Harris,M,22.0,3,7.2500,Southampton,no
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38.0,1,71.2833,Cherbourg,yes

In [31]:
# Delete row, show first two rows of output
dataframe[dataframe.index != 0].head(2)

,last,first,gender,age,class,fare,embarked,survived
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38.0,1,71.2833,Cherbourg,yes
2,Heikkinen,Miss Laina,F,26.0,3,7.9250,Southampton,yes

In [32]:
# Drop duplicates, show first two rows of output
dataframe.drop_duplicates().head(2)

,last,first,gender,age,class,fare,embarked,survived
0,Braund,Mr. Owen Harris,M,22.0,3,7.2500,Southampton,no
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38.0,1,71.2833,Cherbourg,yes

In [33]:
# Show number of rows
print("Number Of Rows In The Original DataFrame:", len(dataframe))
print("Number Of Rows After Deduping:", len(dataframe.drop_duplicates()))

Number Of Rows In The Original DataFrame: 891
Number Of Rows After Deduping: 891

In [34]:
# Drop duplicates
dataframe.drop_duplicates(subset=['gender'])

,last,first,gender,age,class,fare,embarked,survived
0,Braund,Mr. Owen Harris,M,22.0,3,7.2500,Southampton,no
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38.0,1,71.2833,Cherbourg,yes

In [35]:
# Drop duplicates
dataframe.drop_duplicates(subset=['gender'], keep='last')

,last,first,gender,age,class,fare,embarked,survived
888,Johnston,"Miss Catherine Helen ""Carrie""",F,NaN,3,23.45,Southampton,no
890,Dooley,Mr. Patrick,M,32.0,3,7.75,Queenstown,no

In [36]:
# Group rows by the values of the column 'Sex', calculate mean
# of each group
dataframe.groupby('gender').mean()

              age     class       fare
gender
F       27.915709  2.159236  44.479818
M       30.726645  2.389948  25.523893

In [37]:
# Group rows
dataframe.groupby('gender')

In [38]:
# Group rows, count rows
dataframe.groupby('survived')['first'].count()

survived
no     549
yes    342
Name: first, dtype: int64

In [39]:
# Group rows, calculate mean
dataframe.groupby(['gender','survived'])['age'].mean()

gender  survived
F       no          25.046875
        yes         28.847716
M       no          31.618056
        yes         27.276022
Name: age, dtype: float64

In [40]:
import pandas as pd
import numpy as np
# Create date range
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')
# Create DataFrame
dataframe = pd.DataFrame(index=time_index)
# Create column of random values
dataframe['Sale_Amount'] = np.random.randint(1, 10, 100000)
# Group rows by week, calculate sum per week
dataframe.resample('W').sum()

            Sale_Amount
2017-06-11        86498
2017-06-18       101279
2017-06-25       100343
2017-07-02       100512
2017-07-09       100805
2017-07-16        10433

In [41]:
# Show three rows
dataframe.head(3)

                     Sale_Amount
2017-06-06 00:00:00            1
2017-06-06 00:00:30            3
2017-06-06 00:01:00            5

In [42]:

# Group by two weeks, calculate mean
dataframe.resample('2W').mean()

            Sale_Amount
2017-06-11     5.005671
2017-06-25     5.000546
2017-07-09     4.992981
2017-07-23     5.015865

In [43]:
# Group by month, count rows
dataframe.resample('M').count()

            Sale_Amount
2017-06-30        72000
2017-07-31        28000

In [44]:
# Group by month, count rows
dataframe.resample('M', label='left').count()

            Sale_Amount
2017-05-31        72000
2017-06-30        28000

In [45]:
import pandas as pd

df = pd.read_csv (r'C:/Users/karthik/ML/titanic.csv')
# Print first two names uppercased
for name in df['first'][0:2]:
    print(name.upper())

MR. OWEN HARRIS
MRS. JOHN BRADLEY (FLORENCE BRIGGS THAYER)

In [46]:
# Show first two names uppercased
[name.upper() for name in df['first'][0:2]]

['MR. OWEN HARRIS', 'MRS. JOHN BRADLEY (FLORENCE BRIGGS THAYER)']

In [47]:
# Create function
def uppercase(x):
    return x.upper()
# Apply function, show two rows
df['first'].apply(uppercase)[0:2]

0                               MR. OWEN HARRIS
1    MRS. JOHN BRADLEY (FLORENCE BRIGGS THAYER)
Name: first, dtype: object

In [48]:
# Group rows, apply function to groups
df.groupby('gender').apply(lambda x: x.count())

        last  first  gender  age  class  fare  embarked  survived
gender
F        314    314     314  261    314   314       314       314
M        577    577     577  453    577   577       577       577

In [49]:
# Load library
import pandas as pd
# Create DataFrame
data_a = {'id': ['1', '2', '3'],'first': ['Alex', 'Amy', 'Allen'],'last': ['Anderson', 'Ackerman', 'Ali']}
dataframe_a = pd.DataFrame(data_a, columns = ['id', 'first', 'last'])
# Create DataFrame
data_b = {'id': ['4', '5', '6'],'first': ['Billy', 'Brian', 'Bran'],'last': ['Bonder', 'Black', 'Balwner']}
dataframe_b = pd.DataFrame(data_b, columns = ['id', 'first', 'last'])
# Concatenate DataFrames by rows
pd.concat([dataframe_a, dataframe_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [50]:
# Concatenate DataFrames by columns
pd.concat([dataframe_a, dataframe_b], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

In [51]:
# Create row
row = pd.Series([10, 'Chris', 'Chillon'], index=['id', 'first', 'last'])
# Append row
dataframe_a.append(row, ignore_index=True)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
3  10  Chris   Chillon

In [52]:
# Load library
import pandas as pd
# Create DataFrame
employee_data = {'employee_id': ['1', '2', '3', '4'],
 'name': ['Amy Jones', 'Allen Keys', 'Alice Bees',
 'Tim Horton']}
dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id',
 'name'])
# Create DataFrame
sales_data = {'employee_id': ['3', '4', '5', '6'],
 'total_sales': [23456, 2512, 2345, 1455]}
dataframe_sales = pd.DataFrame(sales_data, columns = ['employee_id',
 'total_sales'])
# Merge DataFrames
pd.merge(dataframe_employees, dataframe_sales, on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512

In [53]:
# Merge DataFrames
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [54]:
# Merge DataFrames
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='left')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tim Horton       2512.0

In [55]:

# Merge DataFrames
pd.merge(dataframe_employees,dataframe_sales,left_on='employee_id',right_on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tim Horton         2512